04_tests/reports/performance/raw/interface-comparison-2026-08-28/microservices-search-run3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-interface-comparison.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * interface_comparison: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 2874 complete and 0 interrupted iterations
interface_comparison   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 5671 complete and 0 interrupted iterations
interface_comparison   [  10% ] 5 VUs  02.0s/20s

running (03.0s), 5/5 VUs, 8460 complete and 0 interrupted iterations
interface_comparison   [  15% ] 5 VUs  03.0s/20s

running (04.0s), 5/5 VUs, 11291 complete and 0 interrupted iterations
interface_comparison   [  20% ] 5 VUs  04.0s/20s

running (05.0s), 5/5 VUs, 13937 complete and 0 interrupted iterations
interface_comparison   [  25% ] 5 VUs  05.0s/20s

running (06.0s), 5/5 VUs, 16415 complete and 0 interrupted iterations
interface_comparison   [  30% ] 5 VUs  06.0s/20s

running (07.0s), 5/5 VUs, 19223 complete and 0 interrupted iterations
interface_comparison   [  35% ] 5 VUs  07.0s/20s

running (08.0s), 5/5 VUs, 21839 complete and 0 interrupted iterations
interface_comparison   [  40% ] 5 VUs  08.0s/20s

running (09.0s), 5/5 VUs, 24513 complete and 0 interrupted iterations
interface_comparison   [  45% ] 5 VUs  09.0s/20s

running (10.0s), 5/5 VUs, 27155 complete and 0 interrupted iterations
interface_comparison   [  50% ] 5 VUs  10.0s/20s

running (11.0s), 5/5 VUs, 29893 complete and 0 interrupted iterations
interface_comparison   [  55% ] 5 VUs  11.0s/20s

running (12.0s), 5/5 VUs, 32509 complete and 0 interrupted iterations
interface_comparison   [  60% ] 5 VUs  12.0s/20s

running (13.0s), 5/5 VUs, 35375 complete and 0 interrupted iterations
interface_comparison   [  65% ] 5 VUs  13.0s/20s

running (14.0s), 5/5 VUs, 38171 complete and 0 interrupted iterations
interface_comparison   [  70% ] 5 VUs  14.0s/20s

running (15.0s), 5/5 VUs, 40787 complete and 0 interrupted iterations
interface_comparison   [  75% ] 5 VUs  15.0s/20s

running (16.0s), 5/5 VUs, 43307 complete and 0 interrupted iterations
interface_comparison   [  80% ] 5 VUs  16.0s/20s

running (17.0s), 5/5 VUs, 45985 complete and 0 interrupted iterations
interface_comparison   [  85% ] 5 VUs  17.0s/20s

running (18.0s), 5/5 VUs, 48627 complete and 0 interrupted iterations
interface_comparison   [  90% ] 5 VUs  18.0s/20s

running (19.0s), 5/5 VUs, 51435 complete and 0 interrupted iterations
interface_comparison   [  95% ] 5 VUs  19.0s/20s

running (20.0s), 5/5 VUs, 54290 complete and 0 interrupted iterations
interface_comparison   [ 100% ] 5 VUs  20.0s/20s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=2.65ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 108594  5429.410884/s
    checks_succeeded...: 100.00% 108594 out of 108594
    checks_failed......: 0.00%   0 out of 108594

    ✓ status is 200
    ✓ response contains fixed dataset

    HTTP
    http_req_duration..............: avg=1.8ms  min=925µs    med=1.66ms max=12.02ms p(90)=2.32ms p(95)=2.65ms
      { expected_response:true }...: avg=1.8ms  min=925µs    med=1.66ms max=12.02ms p(90)=2.32ms p(95)=2.65ms
    http_req_failed................: 0.00%  0 out of 54297
    http_reqs......................: 54297  2714.705442/s

    EXECUTION
    iteration_duration.............: avg=1.83ms min=958.16µs med=1.7ms  max=12.08ms p(90)=2.36ms p(95)=2.69ms
    iterations.....................: 54297  2714.705442/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 69 MB  3.5 MB/s
    data_sent......................: 9.9 MB 493 kB/s



running (20.0s), 0/5 VUs, 54297 complete and 0 interrupted iterations
interface_comparison ✓ [ 100% ] 5 VUs  20s