04_tests/reports/performance/raw/interface-comparison-2026-08-28/monolith-detail-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ply/softw/new/softw/04_tests/performance/k6-interface-comparison.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 50s max duration (incl. graceful stop):
              * interface_comparison: 5 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 1065 complete and 0 interrupted iterations
interface_comparison   [   5% ] 5 VUs  01.0s/20s

running (02.0s), 5/5 VUs, 2181 complete and 0 interrupted iterations
interface_comparison   [  10% ] 5 VUs  02.0s/20s

running (07.1s), 5/5 VUs, 2580 complete and 0 interrupted iterations
interface_comparison   [  15% ] 5 VUs  03.0s/20s

running (08.1s), 5/5 VUs, 2679 complete and 0 interrupted iterations
interface_comparison   [  20% ] 5 VUs  04.0s/20s

running (09.1s), 5/5 VUs, 3279 complete and 0 interrupted iterations
interface_comparison   [  25% ] 5 VUs  05.0s/20s

running (10.1s), 5/5 VUs, 4261 complete and 0 interrupted iterations
interface_comparison   [  30% ] 5 VUs  06.0s/20s

running (11.1s), 5/5 VUs, 5308 complete and 0 interrupted iterations
interface_comparison   [  35% ] 5 VUs  07.0s/20s

running (12.1s), 5/5 VUs, 6405 complete and 0 interrupted iterations
interface_comparison   [  40% ] 5 VUs  08.0s/20s

running (13.1s), 5/5 VUs, 7381 complete and 0 interrupted iterations
interface_comparison   [  45% ] 5 VUs  09.0s/20s

running (14.1s), 5/5 VUs, 8411 complete and 0 interrupted iterations
interface_comparison   [  50% ] 5 VUs  10.0s/20s

running (15.1s), 5/5 VUs, 9481 complete and 0 interrupted iterations
interface_comparison   [  55% ] 5 VUs  11.0s/20s

running (16.1s), 5/5 VUs, 10568 complete and 0 interrupted iterations
interface_comparison   [  60% ] 5 VUs  12.0s/20s

running (17.1s), 5/5 VUs, 11643 complete and 0 interrupted iterations
interface_comparison   [  65% ] 5 VUs  13.0s/20s

running (18.1s), 5/5 VUs, 12614 complete and 0 interrupted iterations
interface_comparison   [  70% ] 5 VUs  14.0s/20s

running (19.1s), 5/5 VUs, 13636 complete and 0 interrupted iterations
interface_comparison   [  75% ] 5 VUs  15.0s/20s

running (20.1s), 5/5 VUs, 14675 complete and 0 interrupted iterations
interface_comparison   [  80% ] 5 VUs  16.0s/20s

running (21.1s), 5/5 VUs, 15685 complete and 0 interrupted iterations
interface_comparison   [  85% ] 5 VUs  17.0s/20s

running (22.1s), 5/5 VUs, 16742 complete and 0 interrupted iterations
interface_comparison   [  90% ] 5 VUs  18.0s/20s

running (23.1s), 5/5 VUs, 17433 complete and 0 interrupted iterations
interface_comparison   [  95% ] 5 VUs  19.0s/20s

running (24.1s), 5/5 VUs, 18187 complete and 0 interrupted iterations
interface_comparison   [ 100% ] 5 VUs  20.0s/20s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<2000' p(95)=8.64ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 36384   1506.982905/s
    checks_succeeded...: 100.00% 36384 out of 36384
    checks_failed......: 0.00%   0 out of 36384

    ✓ status is 200
    ✓ response contains fixed dataset

    HTTP
    http_req_duration..............: avg=6.58ms min=2.71ms med=4.55ms max=4.52s    p(90)=6.7ms  p(95)=8.64ms
      { expected_response:true }...: avg=6.58ms min=2.71ms med=4.55ms max=4.52s    p(90)=6.7ms  p(95)=8.64ms
    http_req_failed................: 0.00%  0 out of 18192
    http_reqs......................: 18192  753.491452/s

    EXECUTION
    iteration_duration.............: avg=5.49ms min=2.9ms  med=4.6ms  max=489.01ms p(90)=6.75ms p(95)=8.72ms
    iterations.....................: 18192  753.491452/s
    vus............................: 5      min=5          max=5
    vus_max........................: 5      min=5          max=5

    NETWORK
    data_received..................: 24 MB  997 kB/s
    data_sent......................: 2.2 MB 90 kB/s



running (24.1s), 0/5 VUs, 18192 complete and 0 interrupted iterations
interface_comparison ✓ [ 100% ] 5 VUs  20s